{
    "title": "How to learn Swift",
    "content": "Swift is a powerful and intuitive programming language for iOS, iPadOS, macOS, tvOS, and watchOS. Writing Swift code is interactive and fun, the syntax is concise yet expressive, and Swift includes modern features developers love. Swift code is safe by design, yet also produces software that runs lightning-fast. Swift was introduced at Apple's 2014 Worldwide Developers Conference (WWDC). It underwent an upgrade to version 1.2 during 2014 and a major upgrade to Swift 2 at WWDC 2015. Initially a proprietary language, version 2.2 was made open-source software under the Apache License 2.0 on December 3, 2015, for Apple's platforms and Linux. Swift is designed to work with Apple's Cocoa and Cocoa Touch frameworks and the large body of existing Objective-C code written for Apple products. Swift is intended to be more resilient against erroneous code (safer) than Objective-C, and more concise. Swift is a general-purpose, multi-paradigm, compiled programming language developed by Apple Inc. and the open-source community. Swift is designed to be fast, safe, and expressive. Swift is a successor to the C, Objective-C, and C++ languages. Swift is designed to work with Apple's Cocoa and Cocoa Touch frameworks and the large body of existing Objective-C code written for Apple products. Swift is intended to be more resilient against erroneous code (safer) than Objective-C, and more concise. Swift is a general-purpose, multi-paradigm, compiled programming language developed by Apple Inc. and the open-source community. Swift is designed to be fast, safe, and expressive. Swift is a successor to the C, Objective-C, and C++ languages. Swift is used to develop applications for iOS, iPadOS, macOS, tvOS, and watchOS. Swift has a growing ecosystem of libraries and tools, and its package manager, Swift Package Manager, makes it easy to manage dependencies and build projects.",
    "author": "Apple Inc.",
    "slug": "learn-swift",
    "url": "https://swift.org/"
}